app/controllers/api/v1/user_management/user/auth_controller.rb

    def signup
        ActiveRecord::Base.transaction do

			#throw_error("Email or Password is missing.", :unprocessable_entity) if signup_params[:email].blank? or signup_params[:password].blank?

			user = User.find_by(email: user_params[:email])
			if user.present?
				throw_error('A User with the given email id already exists', :unprocessable_entity)
			else
			#or Rails.env.development?
            	user = User.new(signup_params)
            	user.save!
				unless Rails.env.test?
					@client = Twilio::REST::Client.new('AC4a9737f66dc2484501dec5f72b618949', '12728c36d7589c5ed9c8df0f625d4e8a')
					@client.verify.v2.services('VAf979b31f78ac39b851c40b5796788c63').verifications.create(:to=> signup_params[:mobilenumber], :channel => 'sms')
				end
				otp=Faker::Number.number(digits: 4)
				otp=Otp.new(user_id:user.id,otp:1729)
				otp.save!
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "pragathisai0912@gmail.com"], ["LIMIT", 1]]
SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "pragathisai0912@gmail.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "reset_password_token", "reset_password_sent_at", "remember_created_at", "created_at", "updated_at", "mobilenumber", "name", "dob", "class_id", "board_id", "profilephoto") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"
INSERT INTO "otps" ("otp", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["otp", "[FILTERED]"], ["user_id", 18], ["created_at", "2022-07-08 08:17:23.078441"], ["updated_at", "2022-07-08 08:17:23.078441"]]

	def login
		@user = User.find_by(id: doorkeeper_token.resource_owner_id)
		@client = Twilio::REST::Client.new('AC4a9737f66dc2484501dec5f72b618949', '12728c36d7589c5ed9c8df0f625d4e8a')
		@client.verify.v2.services('VAf979b31f78ac39b851c40b5796788c63').verifications.create(:to=> signup_params[:mobilenumber], :channel => 'sms')
		otp=Faker::Number.number(digits: 4)
		otp=Otp.new(user_id:user.id,otp:1729)
		otp.save!
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 18], ["LIMIT", 1]]
INSERT INTO "otps" ("otp", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["otp", "[FILTERED]"], ["user_id", 16], ["created_at", "2022-07-05 09:39:51.370903"], ["updated_at", "2022-07-05 09:39:51.370903"]]

	def changemobile
        current_user=User.find_by(id: doorkeeper_token.resource_owner_id)
        current_user.mobilenumber = change_params[:mobilenumber]
        current_user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "mobilenumber" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-07-05 10:28:44.923686"], ["mobilenumber", "9600917567"], ["id", 16]]