app/controllers/api/v1/student_management/subject/print_controller.rb

    def all
	    user = User.find_by(id: doorkeeper_token.resource_owner_id)
        subjects=Subject.where(user_id: user.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "subjects".* FROM "subjects" WHERE "subjects"."user_id" = $1  [["user_id", 16]]