app/controllers/api/v1/student_management/question/review_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."exercise_id" = $1  [["exercise_id", 1]]
SELECT "attempts".* FROM "attempts" WHERE "attempts"."number" = $1 AND "attempts"."question_id" = $2 AND "attempts"."user_id" = $3 LIMIT $4  [["number", 1], ["question_id", 1], ["user_id", 16], ["LIMIT", 1]]
---
    def all
        if review_params[:exercise_id].blank? or review_params[:number].blank?
            throw_error("Exercise_id or number is blank",:unprocessible_entity)
        else
            user = User.find_by(id: doorkeeper_token.resource_owner_id)
            questions=Question.where(exercise_id: review_params[:exercise_id])
            options=Array.new
            for question in questions
                attempt=Attempt.find_by(number: review_params[:number],user_id: user.id)