app/controllers/api/v1/student_management/question/select_controller.rb

    def option
        if select_params[:question_id].blank? or select_params[:option].blank?
            throw_error("Question_id or option is blank",:unprocessible_entity)
        else
	        user = User.find_by(id: doorkeeper_token.resource_owner_id)
            attempt=Attempt.new
            answer=Answer.new
            answer.chosen_option=select_params[:option]
            #attempt.question_id=select_params[:question_id]
            #attempt.option=select_params[:option]
            attempt.user_id=user.id
            question=Question.find_by(id: select_params[:question_id])
            if(user.present?)
                attempt.number=1
            else
                attempt.number+=1
            end
            answer.review=false
            attempt.exercise_id=question.exercise_id
            attempt.save!
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "attempts" ("option", "review", "number", "question_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["option", "Option 1 "], ["review", false], ["number", 1], ["question_id", 1], ["created_at", "2022-07-07 17:35:12.293543"], ["updated_at", "2022-07-07 17:35:12.293543"], ["user_id", 16]]

    def review
        if review_params[:number].blank? or review_params[:question_id].blank?
            throw_error("Number or question_id is blank",:unprocessible_entity)
        else
	        user = User.find_by(id: doorkeeper_token.resource_owner_id)
            attempt=Attempt.find_by(number: review_params[:number])
            answer=Answer.find_by(question_id: review_params[:question_id],attempt_id:attempt.id)
            if answer.present?
                answer.review=true
                answer.save!
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "attempts".* FROM "attempts" WHERE "attempts"."number" = $1 AND "attempts"."question_id" = $2 LIMIT $3  [["number", 1], ["question_id", 1], ["LIMIT", 1]]
UPDATE "attempts" SET "review" = $1, "updated_at" = $2 WHERE "attempts"."id" = $3  [["review", true], ["updated_at", "2022-07-07 17:43:11.506258"], ["id", 1]]