app/controllers/api/v1/student_management/content/option_controller.rb

    def change
        if option_params[:type].blank? or option_params[:value].blank? or option_params[:content_id].blank?
            throw_error("Type or Value or Content_id is blank",:unprocessable_entity)
        else
            content=Content.find_by(id: option_params[:content_id])
---
SELECT "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def click
        if option_params[:content_id].blank?
            throw_error("Content_id is blank",:unprocessable_entity)
        else
            content=Content.find_by(id: params[:content_id])
---
SELECT "contents".* FROM "contents" WHERE "contents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]