app/controllers/api/v1/student_management/chapter/print_controller.rb

    def all
	    user = User.find_by(id: doorkeeper_token.resource_owner_id)
        subject=Subject.find_by(user_id: user.id,id:subject_params[:subject_id])
        if(subject.present?)
            chapters=Chapter.where(subject_id:subject.id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
SELECT "subjects".* FROM "subjects" WHERE "subjects"."user_id" = $1 AND "subjects"."id" = $2 LIMIT $3  [["user_id", 16], ["id", 1], ["LIMIT", 1]]
SELECT "chapters".* FROM "chapters" WHERE "chapters"."subject_id" = $1  [["subject_id", 1]]