app/controllers/concerns/active_user.rb

    def validate_user!
      user = User.find_by(id: doorkeeper_token.resource_owner_id) unless doorkeeper_token.blank?
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]

    def current_user
      User.find_by(id: doorkeeper_token.resource_owner_id) unless doorkeeper_token.blank?
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]

    def generate_refresh_token
      loop do
        token = SecureRandom.hex(32)
        break token unless Doorkeeper::AccessToken.exists?(refresh_token: token)
---
SELECT "oauth_access_tokens".* FROM "oauth_access_tokens" WHERE "oauth_access_tokens"."token" = $1 LIMIT $2  [["token", "[FILTERED]"], ["LIMIT", 1]]
SELECT 1 AS one FROM "oauth_access_tokens" WHERE "oauth_access_tokens"."refresh_token" = $1 LIMIT $2  [["refresh_token", "[FILTERED]"], ["LIMIT", 1]]