app/controllers/api/v1/student_management/student/detail_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = $1, "class_id" = $2 WHERE "users"."id" = $3  [["updated_at", "2022-07-06 13:13:48.159564"], ["class_id", 1], ["id", 16]]
---
    def enter
		user = User.find_by(id: doorkeeper_token.resource_owner_id)
        if(detail_params[:type].blank? or detail_params[:id].blank?)
            throw_error("Type or id is blank",:unprocessible_identity)
        else
            if(detail_params[:type]=="Board")
                user.board_id=detail_params[:id]
                user.save!