app/controllers/api/v1/student_management/student/print_controller.rb

    def details
	    user = User.find_by(id: doorkeeper_token.resource_owner_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]